---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.CircuitNaming.Phase
enum: Autodesk.Revit.DB.Electrical.CircuitNaming
source: html/e3e6582d-f4f9-03db-9cd3-2c74276fec84.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNaming.Phase

Circuit naming is By Phase.